espressif/esp-idf/components/soc/esp32c2/register/soc/ledc_reg.h
/*
 * SPDX-FileCopyrightText: 2020-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"

#ifdef __cplusplus
extern "C" {
#endif
/** Configuration Register */

/** LEDC_CH0_CONF0_REG register
 *  Configuration register 0 for channel
 *  0
 */
#define LEDC_CH0_CONF0_REG (DR_REG_LEDC_BASE + 0x0)
/* LEDC_TIMER_SEL_CH0 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 0.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH0    0x00000003
#define LEDC_TIMER_SEL_CH0_M  (LEDC_TIMER_SEL_CH0_V << LEDC_TIMER_SEL_CH0_S)
#define LEDC_TIMER_SEL_CH0_V  0x00000003
#define LEDC_TIMER_SEL_CH0_S  0
/* LEDC_SIG_OUT_EN_CH0 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 0.
 */
#define LEDC_SIG_OUT_EN_CH0    (BIT(2))
#define LEDC_SIG_OUT_EN_CH0_M  (LEDC_SIG_OUT_EN_CH0_V << LEDC_SIG_OUT_EN_CH0_S)
#define LEDC_SIG_OUT_EN_CH0_V  0x00000001
#define LEDC_SIG_OUT_EN_CH0_S  2
/* LEDC_IDLE_LV_CH0 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 0 is inactive
 * (when LEDC_SIG_OUT_EN_CH0 is
 * 0).
 */
#define LEDC_IDLE_LV_CH0    (BIT(3))
#define LEDC_IDLE_LV_CH0_M  (LEDC_IDLE_LV_CH0_V << LEDC_IDLE_LV_CH0_S)
#define LEDC_IDLE_LV_CH0_V  0x00000001
#define LEDC_IDLE_LV_CH0_S  3
/* LEDC_PARA_UP_CH0 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH0, LEDC_DUTY_START_CH0,
 * LEDC_SIG_OUT_EN_CH0, LEDC_TIMER_SEL_CH0, LEDC_DUTY_NUM_CH0,
 * LEDC_DUTY_CYCLE_CH0, LEDC_DUTY_SCALE_CH0, LEDC_DUTY_INC_CH0, and
 * LEDC_OVF_CNT_EN_CH0 fields for channel 0, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH0    (BIT(4))
#define LEDC_PARA_UP_CH0_M  (LEDC_PARA_UP_CH0_V << LEDC_PARA_UP_CH0_S)
#define LEDC_PARA_UP_CH0_V  0x00000001
#define LEDC_PARA_UP_CH0_S  4
/* LEDC_OVF_NUM_CH0 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH0_INT interrupt will be triggered when channel 0
 * overflows for (LEDC_OVF_NUM_CH0 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH0    0x000003FF
#define LEDC_OVF_NUM_CH0_M  (LEDC_OVF_NUM_CH0_V << LEDC_OVF_NUM_CH0_S)
#define LEDC_OVF_NUM_CH0_V  0x000003FF
#define LEDC_OVF_NUM_CH0_S  5
/* LEDC_OVF_CNT_EN_CH0 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 0.
 */
#define LEDC_OVF_CNT_EN_CH0    (BIT(15))
#define LEDC_OVF_CNT_EN_CH0_M  (LEDC_OVF_CNT_EN_CH0_V << LEDC_OVF_CNT_EN_CH0_S)
#define LEDC_OVF_CNT_EN_CH0_V  0x00000001
#define LEDC_OVF_CNT_EN_CH0_S  15
/* LEDC_OVF_CNT_RESET_CH0 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 0.
 */
#define LEDC_OVF_CNT_RESET_CH0    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH0_M  (LEDC_OVF_CNT_RESET_CH0_V << LEDC_OVF_CNT_RESET_CH0_S)
#define LEDC_OVF_CNT_RESET_CH0_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH0_S  16

/** LEDC_CH0_CONF1_REG register
 *  Configuration register 1 for channel
 *  0
 */
#define LEDC_CH0_CONF1_REG (DR_REG_LEDC_BASE + 0xc)
/* LEDC_DUTY_SCALE_CH0 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 0.
 */
#define LEDC_DUTY_SCALE_CH0    0x000003FF
#define LEDC_DUTY_SCALE_CH0_M  (LEDC_DUTY_SCALE_CH0_V << LEDC_DUTY_SCALE_CH0_S)
#define LEDC_DUTY_SCALE_CH0_V  0x000003FF
#define LEDC_DUTY_SCALE_CH0_S  0
/* LEDC_DUTY_CYCLE_CH0 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH0 on channel
 * 0.
 */
#define LEDC_DUTY_CYCLE_CH0    0x000003FF
#define LEDC_DUTY_CYCLE_CH0_M  (LEDC_DUTY_CYCLE_CH0_V << LEDC_DUTY_CYCLE_CH0_S)
#define LEDC_DUTY_CYCLE_CH0_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH0_S  10
/* LEDC_DUTY_NUM_CH0 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH0    0x000003FF
#define LEDC_DUTY_NUM_CH0_M  (LEDC_DUTY_NUM_CH0_V << LEDC_DUTY_NUM_CH0_S)
#define LEDC_DUTY_NUM_CH0_V  0x000003FF
#define LEDC_DUTY_NUM_CH0_S  20
/* LEDC_DUTY_INC_CH0 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 0. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH0    (BIT(30))
#define LEDC_DUTY_INC_CH0_M  (LEDC_DUTY_INC_CH0_V << LEDC_DUTY_INC_CH0_S)
#define LEDC_DUTY_INC_CH0_V  0x00000001
#define LEDC_DUTY_INC_CH0_S  30
/* LEDC_DUTY_START_CH0 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH0_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH0    (BIT(31))
#define LEDC_DUTY_START_CH0_M  (LEDC_DUTY_START_CH0_V << LEDC_DUTY_START_CH0_S)
#define LEDC_DUTY_START_CH0_V  0x00000001
#define LEDC_DUTY_START_CH0_S  31

/** LEDC_CH1_CONF0_REG register
 *  Configuration register 0 for channel
 *  1
 */
#define LEDC_CH1_CONF0_REG (DR_REG_LEDC_BASE + 0x14)
/* LEDC_TIMER_SEL_CH1 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 1.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH1    0x00000003
#define LEDC_TIMER_SEL_CH1_M  (LEDC_TIMER_SEL_CH1_V << LEDC_TIMER_SEL_CH1_S)
#define LEDC_TIMER_SEL_CH1_V  0x00000003
#define LEDC_TIMER_SEL_CH1_S  0
/* LEDC_SIG_OUT_EN_CH1 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 1.
 */
#define LEDC_SIG_OUT_EN_CH1    (BIT(2))
#define LEDC_SIG_OUT_EN_CH1_M  (LEDC_SIG_OUT_EN_CH1_V << LEDC_SIG_OUT_EN_CH1_S)
#define LEDC_SIG_OUT_EN_CH1_V  0x00000001
#define LEDC_SIG_OUT_EN_CH1_S  2
/* LEDC_IDLE_LV_CH1 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 1 is inactive
 * (when LEDC_SIG_OUT_EN_CH1 is
 * 0).
 */
#define LEDC_IDLE_LV_CH1    (BIT(3))
#define LEDC_IDLE_LV_CH1_M  (LEDC_IDLE_LV_CH1_V << LEDC_IDLE_LV_CH1_S)
#define LEDC_IDLE_LV_CH1_V  0x00000001
#define LEDC_IDLE_LV_CH1_S  3
/* LEDC_PARA_UP_CH1 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH1, LEDC_DUTY_START_CH1,
 * LEDC_SIG_OUT_EN_CH1, LEDC_TIMER_SEL_CH1, LEDC_DUTY_NUM_CH1,
 * LEDC_DUTY_CYCLE_CH1, LEDC_DUTY_SCALE_CH1, LEDC_DUTY_INC_CH1, and
 * LEDC_OVF_CNT_EN_CH1 fields for channel 1, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH1    (BIT(4))
#define LEDC_PARA_UP_CH1_M  (LEDC_PARA_UP_CH1_V << LEDC_PARA_UP_CH1_S)
#define LEDC_PARA_UP_CH1_V  0x00000001
#define LEDC_PARA_UP_CH1_S  4
/* LEDC_OVF_NUM_CH1 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH1_INT interrupt will be triggered when channel 1
 * overflows for (LEDC_OVF_NUM_CH1 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH1    0x000003FF
#define LEDC_OVF_NUM_CH1_M  (LEDC_OVF_NUM_CH1_V << LEDC_OVF_NUM_CH1_S)
#define LEDC_OVF_NUM_CH1_V  0x000003FF
#define LEDC_OVF_NUM_CH1_S  5
/* LEDC_OVF_CNT_EN_CH1 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 1.
 */
#define LEDC_OVF_CNT_EN_CH1    (BIT(15))
#define LEDC_OVF_CNT_EN_CH1_M  (LEDC_OVF_CNT_EN_CH1_V << LEDC_OVF_CNT_EN_CH1_S)
#define LEDC_OVF_CNT_EN_CH1_V  0x00000001
#define LEDC_OVF_CNT_EN_CH1_S  15
/* LEDC_OVF_CNT_RESET_CH1 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 1.
 */
#define LEDC_OVF_CNT_RESET_CH1    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH1_M  (LEDC_OVF_CNT_RESET_CH1_V << LEDC_OVF_CNT_RESET_CH1_S)
#define LEDC_OVF_CNT_RESET_CH1_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH1_S  16

/** LEDC_CH1_CONF1_REG register
 *  Configuration register 1 for channel
 *  1
 */
#define LEDC_CH1_CONF1_REG (DR_REG_LEDC_BASE + 0x20)
/* LEDC_DUTY_SCALE_CH1 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 1.
 */
#define LEDC_DUTY_SCALE_CH1    0x000003FF
#define LEDC_DUTY_SCALE_CH1_M  (LEDC_DUTY_SCALE_CH1_V << LEDC_DUTY_SCALE_CH1_S)
#define LEDC_DUTY_SCALE_CH1_V  0x000003FF
#define LEDC_DUTY_SCALE_CH1_S  0
/* LEDC_DUTY_CYCLE_CH1 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH1 on channel
 * 1.
 */
#define LEDC_DUTY_CYCLE_CH1    0x000003FF
#define LEDC_DUTY_CYCLE_CH1_M  (LEDC_DUTY_CYCLE_CH1_V << LEDC_DUTY_CYCLE_CH1_S)
#define LEDC_DUTY_CYCLE_CH1_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH1_S  10
/* LEDC_DUTY_NUM_CH1 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH1    0x000003FF
#define LEDC_DUTY_NUM_CH1_M  (LEDC_DUTY_NUM_CH1_V << LEDC_DUTY_NUM_CH1_S)
#define LEDC_DUTY_NUM_CH1_V  0x000003FF
#define LEDC_DUTY_NUM_CH1_S  20
/* LEDC_DUTY_INC_CH1 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 1. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH1    (BIT(30))
#define LEDC_DUTY_INC_CH1_M  (LEDC_DUTY_INC_CH1_V << LEDC_DUTY_INC_CH1_S)
#define LEDC_DUTY_INC_CH1_V  0x00000001
#define LEDC_DUTY_INC_CH1_S  30
/* LEDC_DUTY_START_CH1 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH1_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH1    (BIT(31))
#define LEDC_DUTY_START_CH1_M  (LEDC_DUTY_START_CH1_V << LEDC_DUTY_START_CH1_S)
#define LEDC_DUTY_START_CH1_V  0x00000001
#define LEDC_DUTY_START_CH1_S  31

/** LEDC_CH2_CONF0_REG register
 *  Configuration register 0 for channel
 *  2
 */
#define LEDC_CH2_CONF0_REG (DR_REG_LEDC_BASE + 0x28)
/* LEDC_TIMER_SEL_CH2 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 2.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH2    0x00000003
#define LEDC_TIMER_SEL_CH2_M  (LEDC_TIMER_SEL_CH2_V << LEDC_TIMER_SEL_CH2_S)
#define LEDC_TIMER_SEL_CH2_V  0x00000003
#define LEDC_TIMER_SEL_CH2_S  0
/* LEDC_SIG_OUT_EN_CH2 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 2.
 */
#define LEDC_SIG_OUT_EN_CH2    (BIT(2))
#define LEDC_SIG_OUT_EN_CH2_M  (LEDC_SIG_OUT_EN_CH2_V << LEDC_SIG_OUT_EN_CH2_S)
#define LEDC_SIG_OUT_EN_CH2_V  0x00000001
#define LEDC_SIG_OUT_EN_CH2_S  2
/* LEDC_IDLE_LV_CH2 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 2 is inactive
 * (when LEDC_SIG_OUT_EN_CH2 is
 * 0).
 */
#define LEDC_IDLE_LV_CH2    (BIT(3))
#define LEDC_IDLE_LV_CH2_M  (LEDC_IDLE_LV_CH2_V << LEDC_IDLE_LV_CH2_S)
#define LEDC_IDLE_LV_CH2_V  0x00000001
#define LEDC_IDLE_LV_CH2_S  3
/* LEDC_PARA_UP_CH2 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH2, LEDC_DUTY_START_CH2,
 * LEDC_SIG_OUT_EN_CH2, LEDC_TIMER_SEL_CH2, LEDC_DUTY_NUM_CH2,
 * LEDC_DUTY_CYCLE_CH2, LEDC_DUTY_SCALE_CH2, LEDC_DUTY_INC_CH2, and
 * LEDC_OVF_CNT_EN_CH2 fields for channel 2, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH2    (BIT(4))
#define LEDC_PARA_UP_CH2_M  (LEDC_PARA_UP_CH2_V << LEDC_PARA_UP_CH2_S)
#define LEDC_PARA_UP_CH2_V  0x00000001
#define LEDC_PARA_UP_CH2_S  4
/* LEDC_OVF_NUM_CH2 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH2_INT interrupt will be triggered when channel 2
 * overflows for (LEDC_OVF_NUM_CH2 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH2    0x000003FF
#define LEDC_OVF_NUM_CH2_M  (LEDC_OVF_NUM_CH2_V << LEDC_OVF_NUM_CH2_S)
#define LEDC_OVF_NUM_CH2_V  0x000003FF
#define LEDC_OVF_NUM_CH2_S  5
/* LEDC_OVF_CNT_EN_CH2 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 2.
 */
#define LEDC_OVF_CNT_EN_CH2    (BIT(15))
#define LEDC_OVF_CNT_EN_CH2_M  (LEDC_OVF_CNT_EN_CH2_V << LEDC_OVF_CNT_EN_CH2_S)
#define LEDC_OVF_CNT_EN_CH2_V  0x00000001
#define LEDC_OVF_CNT_EN_CH2_S  15
/* LEDC_OVF_CNT_RESET_CH2 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 2.
 */
#define LEDC_OVF_CNT_RESET_CH2    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH2_M  (LEDC_OVF_CNT_RESET_CH2_V << LEDC_OVF_CNT_RESET_CH2_S)
#define LEDC_OVF_CNT_RESET_CH2_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH2_S  16

/** LEDC_CH2_CONF1_REG register
 *  Configuration register 1 for channel
 *  2
 */
#define LEDC_CH2_CONF1_REG (DR_REG_LEDC_BASE + 0x34)
/* LEDC_DUTY_SCALE_CH2 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 2.
 */
#define LEDC_DUTY_SCALE_CH2    0x000003FF
#define LEDC_DUTY_SCALE_CH2_M  (LEDC_DUTY_SCALE_CH2_V << LEDC_DUTY_SCALE_CH2_S)
#define LEDC_DUTY_SCALE_CH2_V  0x000003FF
#define LEDC_DUTY_SCALE_CH2_S  0
/* LEDC_DUTY_CYCLE_CH2 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH2 on channel
 * 2.
 */
#define LEDC_DUTY_CYCLE_CH2    0x000003FF
#define LEDC_DUTY_CYCLE_CH2_M  (LEDC_DUTY_CYCLE_CH2_V << LEDC_DUTY_CYCLE_CH2_S)
#define LEDC_DUTY_CYCLE_CH2_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH2_S  10
/* LEDC_DUTY_NUM_CH2 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH2    0x000003FF
#define LEDC_DUTY_NUM_CH2_M  (LEDC_DUTY_NUM_CH2_V << LEDC_DUTY_NUM_CH2_S)
#define LEDC_DUTY_NUM_CH2_V  0x000003FF
#define LEDC_DUTY_NUM_CH2_S  20
/* LEDC_DUTY_INC_CH2 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 2. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH2    (BIT(30))
#define LEDC_DUTY_INC_CH2_M  (LEDC_DUTY_INC_CH2_V << LEDC_DUTY_INC_CH2_S)
#define LEDC_DUTY_INC_CH2_V  0x00000001
#define LEDC_DUTY_INC_CH2_S  30
/* LEDC_DUTY_START_CH2 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH2_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH2    (BIT(31))
#define LEDC_DUTY_START_CH2_M  (LEDC_DUTY_START_CH2_V << LEDC_DUTY_START_CH2_S)
#define LEDC_DUTY_START_CH2_V  0x00000001
#define LEDC_DUTY_START_CH2_S  31

/** LEDC_CH3_CONF0_REG register
 *  Configuration register 0 for channel
 *  3
 */
#define LEDC_CH3_CONF0_REG (DR_REG_LEDC_BASE + 0x3c)
/* LEDC_TIMER_SEL_CH3 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 3.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH3    0x00000003
#define LEDC_TIMER_SEL_CH3_M  (LEDC_TIMER_SEL_CH3_V << LEDC_TIMER_SEL_CH3_S)
#define LEDC_TIMER_SEL_CH3_V  0x00000003
#define LEDC_TIMER_SEL_CH3_S  0
/* LEDC_SIG_OUT_EN_CH3 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 3.
 */
#define LEDC_SIG_OUT_EN_CH3    (BIT(2))
#define LEDC_SIG_OUT_EN_CH3_M  (LEDC_SIG_OUT_EN_CH3_V << LEDC_SIG_OUT_EN_CH3_S)
#define LEDC_SIG_OUT_EN_CH3_V  0x00000001
#define LEDC_SIG_OUT_EN_CH3_S  2
/* LEDC_IDLE_LV_CH3 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 3 is inactive
 * (when LEDC_SIG_OUT_EN_CH3 is
 * 0).
 */
#define LEDC_IDLE_LV_CH3    (BIT(3))
#define LEDC_IDLE_LV_CH3_M  (LEDC_IDLE_LV_CH3_V << LEDC_IDLE_LV_CH3_S)
#define LEDC_IDLE_LV_CH3_V  0x00000001
#define LEDC_IDLE_LV_CH3_S  3
/* LEDC_PARA_UP_CH3 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH3, LEDC_DUTY_START_CH3,
 * LEDC_SIG_OUT_EN_CH3, LEDC_TIMER_SEL_CH3, LEDC_DUTY_NUM_CH3,
 * LEDC_DUTY_CYCLE_CH3, LEDC_DUTY_SCALE_CH3, LEDC_DUTY_INC_CH3, and
 * LEDC_OVF_CNT_EN_CH3 fields for channel 3, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH3    (BIT(4))
#define LEDC_PARA_UP_CH3_M  (LEDC_PARA_UP_CH3_V << LEDC_PARA_UP_CH3_S)
#define LEDC_PARA_UP_CH3_V  0x00000001
#define LEDC_PARA_UP_CH3_S  4
/* LEDC_OVF_NUM_CH3 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH3_INT interrupt will be triggered when channel 3
 * overflows for (LEDC_OVF_NUM_CH3 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH3    0x000003FF
#define LEDC_OVF_NUM_CH3_M  (LEDC_OVF_NUM_CH3_V << LEDC_OVF_NUM_CH3_S)
#define LEDC_OVF_NUM_CH3_V  0x000003FF
#define LEDC_OVF_NUM_CH3_S  5
/* LEDC_OVF_CNT_EN_CH3 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 3.
 */
#define LEDC_OVF_CNT_EN_CH3    (BIT(15))
#define LEDC_OVF_CNT_EN_CH3_M  (LEDC_OVF_CNT_EN_CH3_V << LEDC_OVF_CNT_EN_CH3_S)
#define LEDC_OVF_CNT_EN_CH3_V  0x00000001
#define LEDC_OVF_CNT_EN_CH3_S  15
/* LEDC_OVF_CNT_RESET_CH3 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 3.
 */
#define LEDC_OVF_CNT_RESET_CH3    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH3_M  (LEDC_OVF_CNT_RESET_CH3_V << LEDC_OVF_CNT_RESET_CH3_S)
#define LEDC_OVF_CNT_RESET_CH3_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH3_S  16

/** LEDC_CH3_CONF1_REG register
 *  Configuration register 1 for channel
 *  3
 */
#define LEDC_CH3_CONF1_REG (DR_REG_LEDC_BASE + 0x48)
/* LEDC_DUTY_SCALE_CH3 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 3.
 */
#define LEDC_DUTY_SCALE_CH3    0x000003FF
#define LEDC_DUTY_SCALE_CH3_M  (LEDC_DUTY_SCALE_CH3_V << LEDC_DUTY_SCALE_CH3_S)
#define LEDC_DUTY_SCALE_CH3_V  0x000003FF
#define LEDC_DUTY_SCALE_CH3_S  0
/* LEDC_DUTY_CYCLE_CH3 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH3 on channel
 * 3.
 */
#define LEDC_DUTY_CYCLE_CH3    0x000003FF
#define LEDC_DUTY_CYCLE_CH3_M  (LEDC_DUTY_CYCLE_CH3_V << LEDC_DUTY_CYCLE_CH3_S)
#define LEDC_DUTY_CYCLE_CH3_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH3_S  10
/* LEDC_DUTY_NUM_CH3 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH3    0x000003FF
#define LEDC_DUTY_NUM_CH3_M  (LEDC_DUTY_NUM_CH3_V << LEDC_DUTY_NUM_CH3_S)
#define LEDC_DUTY_NUM_CH3_V  0x000003FF
#define LEDC_DUTY_NUM_CH3_S  20
/* LEDC_DUTY_INC_CH3 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 3. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH3    (BIT(30))
#define LEDC_DUTY_INC_CH3_M  (LEDC_DUTY_INC_CH3_V << LEDC_DUTY_INC_CH3_S)
#define LEDC_DUTY_INC_CH3_V  0x00000001
#define LEDC_DUTY_INC_CH3_S  30
/* LEDC_DUTY_START_CH3 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH3_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH3    (BIT(31))
#define LEDC_DUTY_START_CH3_M  (LEDC_DUTY_START_CH3_V << LEDC_DUTY_START_CH3_S)
#define LEDC_DUTY_START_CH3_V  0x00000001
#define LEDC_DUTY_START_CH3_S  31

/** LEDC_CH4_CONF0_REG register
 *  Configuration register 0 for channel
 *  4
 */
#define LEDC_CH4_CONF0_REG (DR_REG_LEDC_BASE + 0x50)
/* LEDC_TIMER_SEL_CH4 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 4.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH4    0x00000003
#define LEDC_TIMER_SEL_CH4_M  (LEDC_TIMER_SEL_CH4_V << LEDC_TIMER_SEL_CH4_S)
#define LEDC_TIMER_SEL_CH4_V  0x00000003
#define LEDC_TIMER_SEL_CH4_S  0
/* LEDC_SIG_OUT_EN_CH4 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 4.
 */
#define LEDC_SIG_OUT_EN_CH4    (BIT(2))
#define LEDC_SIG_OUT_EN_CH4_M  (LEDC_SIG_OUT_EN_CH4_V << LEDC_SIG_OUT_EN_CH4_S)
#define LEDC_SIG_OUT_EN_CH4_V  0x00000001
#define LEDC_SIG_OUT_EN_CH4_S  2
/* LEDC_IDLE_LV_CH4 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 4 is inactive
 * (when LEDC_SIG_OUT_EN_CH4 is
 * 0).
 */
#define LEDC_IDLE_LV_CH4    (BIT(3))
#define LEDC_IDLE_LV_CH4_M  (LEDC_IDLE_LV_CH4_V << LEDC_IDLE_LV_CH4_S)
#define LEDC_IDLE_LV_CH4_V  0x00000001
#define LEDC_IDLE_LV_CH4_S  3
/* LEDC_PARA_UP_CH4 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH4, LEDC_DUTY_START_CH4,
 * LEDC_SIG_OUT_EN_CH4, LEDC_TIMER_SEL_CH4, LEDC_DUTY_NUM_CH4,
 * LEDC_DUTY_CYCLE_CH4, LEDC_DUTY_SCALE_CH4, LEDC_DUTY_INC_CH4, and
 * LEDC_OVF_CNT_EN_CH4 fields for channel 4, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH4    (BIT(4))
#define LEDC_PARA_UP_CH4_M  (LEDC_PARA_UP_CH4_V << LEDC_PARA_UP_CH4_S)
#define LEDC_PARA_UP_CH4_V  0x00000001
#define LEDC_PARA_UP_CH4_S  4
/* LEDC_OVF_NUM_CH4 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH4_INT interrupt will be triggered when channel 4
 * overflows for (LEDC_OVF_NUM_CH4 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH4    0x000003FF
#define LEDC_OVF_NUM_CH4_M  (LEDC_OVF_NUM_CH4_V << LEDC_OVF_NUM_CH4_S)
#define LEDC_OVF_NUM_CH4_V  0x000003FF
#define LEDC_OVF_NUM_CH4_S  5
/* LEDC_OVF_CNT_EN_CH4 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 4.
 */
#define LEDC_OVF_CNT_EN_CH4    (BIT(15))
#define LEDC_OVF_CNT_EN_CH4_M  (LEDC_OVF_CNT_EN_CH4_V << LEDC_OVF_CNT_EN_CH4_S)
#define LEDC_OVF_CNT_EN_CH4_V  0x00000001
#define LEDC_OVF_CNT_EN_CH4_S  15
/* LEDC_OVF_CNT_RESET_CH4 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 4.
 */
#define LEDC_OVF_CNT_RESET_CH4    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH4_M  (LEDC_OVF_CNT_RESET_CH4_V << LEDC_OVF_CNT_RESET_CH4_S)
#define LEDC_OVF_CNT_RESET_CH4_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH4_S  16

