espressif/esp-idf/components/soc/esp32c2/register/soc/ledc_reg.h
/** LEDC_CH4_CONF1_REG register
 *  Configuration register 1 for channel
 *  4
 */
#define LEDC_CH4_CONF1_REG (DR_REG_LEDC_BASE + 0x5c)
/* LEDC_DUTY_SCALE_CH4 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 4.
 */
#define LEDC_DUTY_SCALE_CH4    0x000003FF
#define LEDC_DUTY_SCALE_CH4_M  (LEDC_DUTY_SCALE_CH4_V << LEDC_DUTY_SCALE_CH4_S)
#define LEDC_DUTY_SCALE_CH4_V  0x000003FF
#define LEDC_DUTY_SCALE_CH4_S  0
/* LEDC_DUTY_CYCLE_CH4 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH4 on channel
 * 4.
 */
#define LEDC_DUTY_CYCLE_CH4    0x000003FF
#define LEDC_DUTY_CYCLE_CH4_M  (LEDC_DUTY_CYCLE_CH4_V << LEDC_DUTY_CYCLE_CH4_S)
#define LEDC_DUTY_CYCLE_CH4_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH4_S  10
/* LEDC_DUTY_NUM_CH4 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH4    0x000003FF
#define LEDC_DUTY_NUM_CH4_M  (LEDC_DUTY_NUM_CH4_V << LEDC_DUTY_NUM_CH4_S)
#define LEDC_DUTY_NUM_CH4_V  0x000003FF
#define LEDC_DUTY_NUM_CH4_S  20
/* LEDC_DUTY_INC_CH4 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 4. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH4    (BIT(30))
#define LEDC_DUTY_INC_CH4_M  (LEDC_DUTY_INC_CH4_V << LEDC_DUTY_INC_CH4_S)
#define LEDC_DUTY_INC_CH4_V  0x00000001
#define LEDC_DUTY_INC_CH4_S  30
/* LEDC_DUTY_START_CH4 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH4_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH4    (BIT(31))
#define LEDC_DUTY_START_CH4_M  (LEDC_DUTY_START_CH4_V << LEDC_DUTY_START_CH4_S)
#define LEDC_DUTY_START_CH4_V  0x00000001
#define LEDC_DUTY_START_CH4_S  31

/** LEDC_CH5_CONF0_REG register
 *  Configuration register 0 for channel
 *  5
 */
#define LEDC_CH5_CONF0_REG (DR_REG_LEDC_BASE + 0x64)
/* LEDC_TIMER_SEL_CH5 : R/W; bitpos: [2:0]; default: 0;
 * This field is used to select one of timers for channel 5.
 * 0: select timer0; 1: select timer1; 2: select timer2; 3: select
 * timer3
 */
#define LEDC_TIMER_SEL_CH5    0x00000003
#define LEDC_TIMER_SEL_CH5_M  (LEDC_TIMER_SEL_CH5_V << LEDC_TIMER_SEL_CH5_S)
#define LEDC_TIMER_SEL_CH5_V  0x00000003
#define LEDC_TIMER_SEL_CH5_S  0
/* LEDC_SIG_OUT_EN_CH5 : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable signal output on channel
 * 5.
 */
#define LEDC_SIG_OUT_EN_CH5    (BIT(2))
#define LEDC_SIG_OUT_EN_CH5_M  (LEDC_SIG_OUT_EN_CH5_V << LEDC_SIG_OUT_EN_CH5_S)
#define LEDC_SIG_OUT_EN_CH5_V  0x00000001
#define LEDC_SIG_OUT_EN_CH5_S  2
/* LEDC_IDLE_LV_CH5 : R/W; bitpos: [3]; default: 0;
 * This bit is used to control the output value when channel 5 is inactive
 * (when LEDC_SIG_OUT_EN_CH5 is
 * 0).
 */
#define LEDC_IDLE_LV_CH5    (BIT(3))
#define LEDC_IDLE_LV_CH5_M  (LEDC_IDLE_LV_CH5_V << LEDC_IDLE_LV_CH5_S)
#define LEDC_IDLE_LV_CH5_V  0x00000001
#define LEDC_IDLE_LV_CH5_S  3
/* LEDC_PARA_UP_CH5 : WT; bitpos: [4]; default: 0;
 * This bit is used to update LEDC_HPOINT_CH5, LEDC_DUTY_START_CH5,
 * LEDC_SIG_OUT_EN_CH5, LEDC_TIMER_SEL_CH5, LEDC_DUTY_NUM_CH5,
 * LEDC_DUTY_CYCLE_CH5, LEDC_DUTY_SCALE_CH5, LEDC_DUTY_INC_CH5, and
 * LEDC_OVF_CNT_EN_CH5 fields for channel 5, and will be automatically
 * cleared by
 * hardware.
 */
#define LEDC_PARA_UP_CH5    (BIT(4))
#define LEDC_PARA_UP_CH5_M  (LEDC_PARA_UP_CH5_V << LEDC_PARA_UP_CH5_S)
#define LEDC_PARA_UP_CH5_V  0x00000001
#define LEDC_PARA_UP_CH5_S  4
/* LEDC_OVF_NUM_CH5 : R/W; bitpos: [15:5]; default: 0;
 * This register is used to configure the maximum times of overflow minus
 * 1.
 * The LEDC_OVF_CNT_CH5_INT interrupt will be triggered when channel 5
 * overflows for (LEDC_OVF_NUM_CH5 + 1)
 * times.
 */
#define LEDC_OVF_NUM_CH5    0x000003FF
#define LEDC_OVF_NUM_CH5_M  (LEDC_OVF_NUM_CH5_V << LEDC_OVF_NUM_CH5_S)
#define LEDC_OVF_NUM_CH5_V  0x000003FF
#define LEDC_OVF_NUM_CH5_S  5
/* LEDC_OVF_CNT_EN_CH5 : R/W; bitpos: [15]; default: 0;
 * This bit is used to enable the ovf_cnt of channel
 * 5.
 */
#define LEDC_OVF_CNT_EN_CH5    (BIT(15))
#define LEDC_OVF_CNT_EN_CH5_M  (LEDC_OVF_CNT_EN_CH5_V << LEDC_OVF_CNT_EN_CH5_S)
#define LEDC_OVF_CNT_EN_CH5_V  0x00000001
#define LEDC_OVF_CNT_EN_CH5_S  15
/* LEDC_OVF_CNT_RESET_CH5 : WT; bitpos: [16]; default: 0;
 * Set this bit to reset the ovf_cnt of channel
 * 5.
 */
#define LEDC_OVF_CNT_RESET_CH5    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH5_M  (LEDC_OVF_CNT_RESET_CH5_V << LEDC_OVF_CNT_RESET_CH5_S)
#define LEDC_OVF_CNT_RESET_CH5_V  0x00000001
#define LEDC_OVF_CNT_RESET_CH5_S  16

/** LEDC_CH5_CONF1_REG register
 *  Configuration register 1 for channel
 *  5
 */
#define LEDC_CH5_CONF1_REG (DR_REG_LEDC_BASE + 0x70)
/* LEDC_DUTY_SCALE_CH5 : R/W; bitpos: [10:0]; default: 0;
 * This register is used to configure the changing step scale of duty on
 * channel
 * 5.
 */
#define LEDC_DUTY_SCALE_CH5    0x000003FF
#define LEDC_DUTY_SCALE_CH5_M  (LEDC_DUTY_SCALE_CH5_V << LEDC_DUTY_SCALE_CH5_S)
#define LEDC_DUTY_SCALE_CH5_V  0x000003FF
#define LEDC_DUTY_SCALE_CH5_S  0
/* LEDC_DUTY_CYCLE_CH5 : R/W; bitpos: [20:10]; default: 0;
 * The duty will change every LEDC_DUTY_CYCLE_CH5 on channel
 * 5.
 */
#define LEDC_DUTY_CYCLE_CH5    0x000003FF
#define LEDC_DUTY_CYCLE_CH5_M  (LEDC_DUTY_CYCLE_CH5_V << LEDC_DUTY_CYCLE_CH5_S)
#define LEDC_DUTY_CYCLE_CH5_V  0x000003FF
#define LEDC_DUTY_CYCLE_CH5_S  10
/* LEDC_DUTY_NUM_CH5 : R/W; bitpos: [30:20]; default: 0;
 * This register is used to control the number of times the duty cycle
 * will be
 * changed.
 */
#define LEDC_DUTY_NUM_CH5    0x000003FF
#define LEDC_DUTY_NUM_CH5_M  (LEDC_DUTY_NUM_CH5_V << LEDC_DUTY_NUM_CH5_S)
#define LEDC_DUTY_NUM_CH5_V  0x000003FF
#define LEDC_DUTY_NUM_CH5_S  20
/* LEDC_DUTY_INC_CH5 : R/W; bitpos: [30]; default: 1;
 * This register is used to increase or decrease the duty of output signal
 * on channel 5. 1: Increase; 0:
 * Decrease.
 */
#define LEDC_DUTY_INC_CH5    (BIT(30))
#define LEDC_DUTY_INC_CH5_M  (LEDC_DUTY_INC_CH5_V << LEDC_DUTY_INC_CH5_S)
#define LEDC_DUTY_INC_CH5_V  0x00000001
#define LEDC_DUTY_INC_CH5_S  30
/* LEDC_DUTY_START_CH5 : R/W/SC; bitpos: [31]; default: 0;
 * Other configured fields in LEDC_CH5_CONF1_REG will start to take effect
 * when this bit is set to
 * 1.
 */
#define LEDC_DUTY_START_CH5    (BIT(31))
#define LEDC_DUTY_START_CH5_M  (LEDC_DUTY_START_CH5_V << LEDC_DUTY_START_CH5_S)
#define LEDC_DUTY_START_CH5_V  0x00000001
#define LEDC_DUTY_START_CH5_S  31

/** LEDC_CONF_REG register
 *  Global ledc configuration
 *  register
 */
#define LEDC_CONF_REG (DR_REG_LEDC_BASE + 0xd0)
/* LEDC_APB_CLK_SEL : R/W; bitpos: [2:0]; default: 0;
 * This bit is used to select clock source for the 4 timers .
 * 2'd1: APB_CLK 2'd2: RTC8M_CLK 2'd3:
 * XTAL_CLK
 */
#define LEDC_APB_CLK_SEL    0x00000003
#define LEDC_APB_CLK_SEL_M  (LEDC_APB_CLK_SEL_V << LEDC_APB_CLK_SEL_S)
#define LEDC_APB_CLK_SEL_V  0x00000003
#define LEDC_APB_CLK_SEL_S  0
/* LEDC_CLK_EN : R/W; bitpos: [31]; default: 0;
 * This bit is used to control clock.
 * 1'b1: Force clock on for register. 1'h0: Support clock only when
 * application writes
 * registers.
 */
#define LEDC_CLK_EN    (BIT(31))
#define LEDC_CLK_EN_M  (LEDC_CLK_EN_V << LEDC_CLK_EN_S)
#define LEDC_CLK_EN_V  0x00000001
#define LEDC_CLK_EN_S  31


/** Hpoint Register */

/** LEDC_CH0_HPOINT_REG register
 *  High point register for channel
 *  0
 */
#define LEDC_CH0_HPOINT_REG (DR_REG_LEDC_BASE + 0x4)
/* LEDC_HPOINT_CH0 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH0    0x00003FFF
#define LEDC_HPOINT_CH0_M  (LEDC_HPOINT_CH0_V << LEDC_HPOINT_CH0_S)
#define LEDC_HPOINT_CH0_V  0x00003FFF
#define LEDC_HPOINT_CH0_S  0

/** LEDC_CH1_HPOINT_REG register
 *  High point register for channel
 *  1
 */
#define LEDC_CH1_HPOINT_REG (DR_REG_LEDC_BASE + 0x18)
/* LEDC_HPOINT_CH1 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH1    0x00003FFF
#define LEDC_HPOINT_CH1_M  (LEDC_HPOINT_CH1_V << LEDC_HPOINT_CH1_S)
#define LEDC_HPOINT_CH1_V  0x00003FFF
#define LEDC_HPOINT_CH1_S  0

/** LEDC_CH2_HPOINT_REG register
 *  High point register for channel
 *  2
 */
#define LEDC_CH2_HPOINT_REG (DR_REG_LEDC_BASE + 0x2c)
/* LEDC_HPOINT_CH2 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH2    0x00003FFF
#define LEDC_HPOINT_CH2_M  (LEDC_HPOINT_CH2_V << LEDC_HPOINT_CH2_S)
#define LEDC_HPOINT_CH2_V  0x00003FFF
#define LEDC_HPOINT_CH2_S  0

