espressif/esp-idf/components/soc/esp32c2/register/soc/ledc_reg.h
/** LEDC_CH3_HPOINT_REG register
 *  High point register for channel
 *  3
 */
#define LEDC_CH3_HPOINT_REG (DR_REG_LEDC_BASE + 0x40)
/* LEDC_HPOINT_CH3 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH3    0x00003FFF
#define LEDC_HPOINT_CH3_M  (LEDC_HPOINT_CH3_V << LEDC_HPOINT_CH3_S)
#define LEDC_HPOINT_CH3_V  0x00003FFF
#define LEDC_HPOINT_CH3_S  0

/** LEDC_CH4_HPOINT_REG register
 *  High point register for channel
 *  4
 */
#define LEDC_CH4_HPOINT_REG (DR_REG_LEDC_BASE + 0x54)
/* LEDC_HPOINT_CH4 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH4    0x00003FFF
#define LEDC_HPOINT_CH4_M  (LEDC_HPOINT_CH4_V << LEDC_HPOINT_CH4_S)
#define LEDC_HPOINT_CH4_V  0x00003FFF
#define LEDC_HPOINT_CH4_S  0

/** LEDC_CH5_HPOINT_REG register
 *  High point register for channel
 *  5
 */
#define LEDC_CH5_HPOINT_REG (DR_REG_LEDC_BASE + 0x68)
/* LEDC_HPOINT_CH5 : R/W; bitpos: [14:0]; default: 0;
 * The output value changes to high when the selected timers has reached
 * the value specified by this
 * register.
 */
#define LEDC_HPOINT_CH5    0x00003FFF
#define LEDC_HPOINT_CH5_M  (LEDC_HPOINT_CH5_V << LEDC_HPOINT_CH5_S)
#define LEDC_HPOINT_CH5_V  0x00003FFF
#define LEDC_HPOINT_CH5_S  0


/** Duty Cycle Register */

/** LEDC_CH0_DUTY_REG register
 *  Initial duty cycle for channel
 *  0
 */
#define LEDC_CH0_DUTY_REG (DR_REG_LEDC_BASE + 0x8)
/* LEDC_DUTY_CH0 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH0    0x0007FFFF
#define LEDC_DUTY_CH0_M  (LEDC_DUTY_CH0_V << LEDC_DUTY_CH0_S)
#define LEDC_DUTY_CH0_V  0x0007FFFF
#define LEDC_DUTY_CH0_S  0

/** LEDC_CH0_DUTY_R_REG register
 *  Current duty cycle for channel
 *  0
 */
#define LEDC_CH0_DUTY_R_REG (DR_REG_LEDC_BASE + 0x10)
/* LEDC_DUTY_R_CH0 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 0.
 */
#define LEDC_DUTY_R_CH0    0x0007FFFF
#define LEDC_DUTY_R_CH0_M  (LEDC_DUTY_R_CH0_V << LEDC_DUTY_R_CH0_S)
#define LEDC_DUTY_R_CH0_V  0x0007FFFF
#define LEDC_DUTY_R_CH0_S  0

/** LEDC_CH1_DUTY_REG register
 *  Initial duty cycle for channel
 *  1
 */
#define LEDC_CH1_DUTY_REG (DR_REG_LEDC_BASE + 0x1c)
/* LEDC_DUTY_CH1 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH1    0x0007FFFF
#define LEDC_DUTY_CH1_M  (LEDC_DUTY_CH1_V << LEDC_DUTY_CH1_S)
#define LEDC_DUTY_CH1_V  0x0007FFFF
#define LEDC_DUTY_CH1_S  0

/** LEDC_CH1_DUTY_R_REG register
 *  Current duty cycle for channel
 *  1
 */
#define LEDC_CH1_DUTY_R_REG (DR_REG_LEDC_BASE + 0x24)
/* LEDC_DUTY_R_CH1 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 1.
 */
#define LEDC_DUTY_R_CH1    0x0007FFFF
#define LEDC_DUTY_R_CH1_M  (LEDC_DUTY_R_CH1_V << LEDC_DUTY_R_CH1_S)
#define LEDC_DUTY_R_CH1_V  0x0007FFFF
#define LEDC_DUTY_R_CH1_S  0

/** LEDC_CH2_DUTY_REG register
 *  Initial duty cycle for channel
 *  2
 */
#define LEDC_CH2_DUTY_REG (DR_REG_LEDC_BASE + 0x30)
/* LEDC_DUTY_CH2 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH2    0x0007FFFF
#define LEDC_DUTY_CH2_M  (LEDC_DUTY_CH2_V << LEDC_DUTY_CH2_S)
#define LEDC_DUTY_CH2_V  0x0007FFFF
#define LEDC_DUTY_CH2_S  0

/** LEDC_CH2_DUTY_R_REG register
 *  Current duty cycle for channel
 *  2
 */
#define LEDC_CH2_DUTY_R_REG (DR_REG_LEDC_BASE + 0x38)
/* LEDC_DUTY_R_CH2 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 2.
 */
#define LEDC_DUTY_R_CH2    0x0007FFFF
#define LEDC_DUTY_R_CH2_M  (LEDC_DUTY_R_CH2_V << LEDC_DUTY_R_CH2_S)
#define LEDC_DUTY_R_CH2_V  0x0007FFFF
#define LEDC_DUTY_R_CH2_S  0

/** LEDC_CH3_DUTY_REG register
 *  Initial duty cycle for channel
 *  3
 */
#define LEDC_CH3_DUTY_REG (DR_REG_LEDC_BASE + 0x44)
/* LEDC_DUTY_CH3 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH3    0x0007FFFF
#define LEDC_DUTY_CH3_M  (LEDC_DUTY_CH3_V << LEDC_DUTY_CH3_S)
#define LEDC_DUTY_CH3_V  0x0007FFFF
#define LEDC_DUTY_CH3_S  0

/** LEDC_CH3_DUTY_R_REG register
 *  Current duty cycle for channel
 *  3
 */
#define LEDC_CH3_DUTY_R_REG (DR_REG_LEDC_BASE + 0x4c)
/* LEDC_DUTY_R_CH3 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 3.
 */
#define LEDC_DUTY_R_CH3    0x0007FFFF
#define LEDC_DUTY_R_CH3_M  (LEDC_DUTY_R_CH3_V << LEDC_DUTY_R_CH3_S)
#define LEDC_DUTY_R_CH3_V  0x0007FFFF
#define LEDC_DUTY_R_CH3_S  0

/** LEDC_CH4_DUTY_REG register
 *  Initial duty cycle for channel
 *  4
 */
#define LEDC_CH4_DUTY_REG (DR_REG_LEDC_BASE + 0x58)
/* LEDC_DUTY_CH4 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH4    0x0007FFFF
#define LEDC_DUTY_CH4_M  (LEDC_DUTY_CH4_V << LEDC_DUTY_CH4_S)
#define LEDC_DUTY_CH4_V  0x0007FFFF
#define LEDC_DUTY_CH4_S  0

/** LEDC_CH4_DUTY_R_REG register
 *  Current duty cycle for channel
 *  4
 */
#define LEDC_CH4_DUTY_R_REG (DR_REG_LEDC_BASE + 0x60)
/* LEDC_DUTY_R_CH4 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 4.
 */
#define LEDC_DUTY_R_CH4    0x0007FFFF
#define LEDC_DUTY_R_CH4_M  (LEDC_DUTY_R_CH4_V << LEDC_DUTY_R_CH4_S)
#define LEDC_DUTY_R_CH4_V  0x0007FFFF
#define LEDC_DUTY_R_CH4_S  0

/** LEDC_CH5_DUTY_REG register
 *  Initial duty cycle for channel
 *  5
 */
#define LEDC_CH5_DUTY_REG (DR_REG_LEDC_BASE + 0x6c)
/* LEDC_DUTY_CH5 : R/W; bitpos: [19:0]; default: 0;
 * This register is used to change the output duty by controlling the
 * Lpoint.
 * The output value turns to low when the selected timers has reached the
 * Lpoint.
 */
#define LEDC_DUTY_CH5    0x0007FFFF
#define LEDC_DUTY_CH5_M  (LEDC_DUTY_CH5_V << LEDC_DUTY_CH5_S)
#define LEDC_DUTY_CH5_V  0x0007FFFF
#define LEDC_DUTY_CH5_S  0

/** LEDC_CH5_DUTY_R_REG register
 *  Current duty cycle for channel
 *  5
 */
#define LEDC_CH5_DUTY_R_REG (DR_REG_LEDC_BASE + 0x74)
/* LEDC_DUTY_R_CH5 : RO; bitpos: [19:0]; default: 0;
 * This register stores the current duty of output signal on channel
 * 5.
 */
#define LEDC_DUTY_R_CH5    0x0007FFFF
#define LEDC_DUTY_R_CH5_M  (LEDC_DUTY_R_CH5_V << LEDC_DUTY_R_CH5_S)
#define LEDC_DUTY_R_CH5_V  0x0007FFFF
#define LEDC_DUTY_R_CH5_S  0


/** Timer Register */

/** LEDC_TIMER0_CONF_REG register
 *  Timer 0
 *  configuration
 */
#define LEDC_TIMER0_CONF_REG (DR_REG_LEDC_BASE + 0xa0)
/* LEDC_TIMER0_DUTY_RES : R/W; bitpos: [4:0]; default: 0;
 * This register is used to control the range of the counter in timer
 * 0.
 */
#define LEDC_TIMER0_DUTY_RES    0x0000000F
#define LEDC_TIMER0_DUTY_RES_M  (LEDC_TIMER0_DUTY_RES_V << LEDC_TIMER0_DUTY_RES_S)
#define LEDC_TIMER0_DUTY_RES_V  0x0000000F
#define LEDC_TIMER0_DUTY_RES_S  0
/* LEDC_CLK_DIV_TIMER0 : R/W; bitpos: [22:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer
 * 0.
 * The least significant eight bits represent the fractional
 * part.
 */
#define LEDC_CLK_DIV_TIMER0    0x0003FFFF
#define LEDC_CLK_DIV_TIMER0_M  (LEDC_CLK_DIV_TIMER0_V << LEDC_CLK_DIV_TIMER0_S)
#define LEDC_CLK_DIV_TIMER0_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER0_S  4
/* LEDC_TIMER0_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer
 * 0.
 */
#define LEDC_TIMER0_PAUSE    (BIT(22))
#define LEDC_TIMER0_PAUSE_M  (LEDC_TIMER0_PAUSE_V << LEDC_TIMER0_PAUSE_S)
#define LEDC_TIMER0_PAUSE_V  0x00000001
#define LEDC_TIMER0_PAUSE_S  22
/* LEDC_TIMER0_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 0. The counter will show 0 after
 * reset.
 */
#define LEDC_TIMER0_RST    (BIT(23))
#define LEDC_TIMER0_RST_M  (LEDC_TIMER0_RST_V << LEDC_TIMER0_RST_S)
#define LEDC_TIMER0_RST_V  0x00000001
#define LEDC_TIMER0_RST_S  23
/* LEDC_TICK_SEL_TIMER0 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 0. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 * 1'h0: SLOW_CLK 1'h1:
 * REF_TICK
 */
#define LEDC_TICK_SEL_TIMER0    (BIT(24))
#define LEDC_TICK_SEL_TIMER0_M  (LEDC_TICK_SEL_TIMER0_V << LEDC_TICK_SEL_TIMER0_S)
#define LEDC_TICK_SEL_TIMER0_V  0x00000001
#define LEDC_TICK_SEL_TIMER0_S  24
/* LEDC_TIMER0_PARA_UP : WT; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER0 and
 * LEDC_TIMER0_DUTY_RES.
 */
#define LEDC_TIMER0_PARA_UP    (BIT(25))
#define LEDC_TIMER0_PARA_UP_M  (LEDC_TIMER0_PARA_UP_V << LEDC_TIMER0_PARA_UP_S)
#define LEDC_TIMER0_PARA_UP_V  0x00000001
#define LEDC_TIMER0_PARA_UP_S  25

/** LEDC_TIMER0_VALUE_REG register
 *  Timer 0 current counter
 *  value
 */
#define LEDC_TIMER0_VALUE_REG (DR_REG_LEDC_BASE + 0xa4)
/* LEDC_TIMER0_CNT : RO; bitpos: [14:0]; default: 0;
 * This register stores the current counter value of timer
 * 0.
 */
#define LEDC_TIMER0_CNT    0x00003FFF
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x00003FFF
#define LEDC_TIMER0_CNT_S  0

/** LEDC_TIMER1_CONF_REG register
 *  Timer 1
 *  configuration
 */
#define LEDC_TIMER1_CONF_REG (DR_REG_LEDC_BASE + 0xa8)
/* LEDC_TIMER1_DUTY_RES : R/W; bitpos: [4:0]; default: 0;
 * This register is used to control the range of the counter in timer
 * 1.
 */
#define LEDC_TIMER1_DUTY_RES    0x0000000F
#define LEDC_TIMER1_DUTY_RES_M  (LEDC_TIMER1_DUTY_RES_V << LEDC_TIMER1_DUTY_RES_S)
#define LEDC_TIMER1_DUTY_RES_V  0x0000000F
#define LEDC_TIMER1_DUTY_RES_S  0
/* LEDC_CLK_DIV_TIMER1 : R/W; bitpos: [22:4]; default: 0;
 * This register is used to configure the divisor for the divider in timer
 * 1.
 * The least significant eight bits represent the fractional
 * part.
 */
#define LEDC_CLK_DIV_TIMER1    0x0003FFFF
#define LEDC_CLK_DIV_TIMER1_M  (LEDC_CLK_DIV_TIMER1_V << LEDC_CLK_DIV_TIMER1_S)
#define LEDC_CLK_DIV_TIMER1_V  0x0003FFFF
#define LEDC_CLK_DIV_TIMER1_S  4
/* LEDC_TIMER1_PAUSE : R/W; bitpos: [22]; default: 0;
 * This bit is used to suspend the counter in timer
 * 1.
 */
#define LEDC_TIMER1_PAUSE    (BIT(22))
#define LEDC_TIMER1_PAUSE_M  (LEDC_TIMER1_PAUSE_V << LEDC_TIMER1_PAUSE_S)
#define LEDC_TIMER1_PAUSE_V  0x00000001
#define LEDC_TIMER1_PAUSE_S  22
/* LEDC_TIMER1_RST : R/W; bitpos: [23]; default: 1;
 * This bit is used to reset timer 1. The counter will show 0 after
 * reset.
 */
#define LEDC_TIMER1_RST    (BIT(23))
#define LEDC_TIMER1_RST_M  (LEDC_TIMER1_RST_V << LEDC_TIMER1_RST_S)
#define LEDC_TIMER1_RST_V  0x00000001
#define LEDC_TIMER1_RST_S  23
/* LEDC_TICK_SEL_TIMER1 : R/W; bitpos: [24]; default: 0;
 * This bit is used to select clock for timer 1. When this bit is set to 1
 * LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not
 * accurate.
 * 1'h0: SLOW_CLK 1'h1:
 * REF_TICK
 */
#define LEDC_TICK_SEL_TIMER1    (BIT(24))
#define LEDC_TICK_SEL_TIMER1_M  (LEDC_TICK_SEL_TIMER1_V << LEDC_TICK_SEL_TIMER1_S)
#define LEDC_TICK_SEL_TIMER1_V  0x00000001
#define LEDC_TICK_SEL_TIMER1_S  24
/* LEDC_TIMER1_PARA_UP : WT; bitpos: [25]; default: 0;
 * Set this bit to update LEDC_CLK_DIV_TIMER1 and
 * LEDC_TIMER1_DUTY_RES.
 */
#define LEDC_TIMER1_PARA_UP    (BIT(25))
#define LEDC_TIMER1_PARA_UP_M  (LEDC_TIMER1_PARA_UP_V << LEDC_TIMER1_PARA_UP_S)
#define LEDC_TIMER1_PARA_UP_V  0x00000001
#define LEDC_TIMER1_PARA_UP_S  25

