espressif/esp-idf/components/soc/esp32c2/register/soc/ledc_reg.h
/** LEDC_INT_ENA_REG register
 *  Interrupt enable
 *  bits
 */
#define LEDC_INT_ENA_REG (DR_REG_LEDC_BASE + 0xc8)
/* LEDC_TIMER0_OVF_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The interrupt enable bit for the LEDC_TIMER0_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER0_OVF_INT_ENA    (BIT(0))
#define LEDC_TIMER0_OVF_INT_ENA_M  (LEDC_TIMER0_OVF_INT_ENA_V << LEDC_TIMER0_OVF_INT_ENA_S)
#define LEDC_TIMER0_OVF_INT_ENA_V  0x00000001
#define LEDC_TIMER0_OVF_INT_ENA_S  0
/* LEDC_TIMER1_OVF_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The interrupt enable bit for the LEDC_TIMER1_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER1_OVF_INT_ENA    (BIT(1))
#define LEDC_TIMER1_OVF_INT_ENA_M  (LEDC_TIMER1_OVF_INT_ENA_V << LEDC_TIMER1_OVF_INT_ENA_S)
#define LEDC_TIMER1_OVF_INT_ENA_V  0x00000001
#define LEDC_TIMER1_OVF_INT_ENA_S  1
/* LEDC_TIMER2_OVF_INT_ENA : R/W; bitpos: [2]; default: 0;
 * The interrupt enable bit for the LEDC_TIMER2_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER2_OVF_INT_ENA    (BIT(2))
#define LEDC_TIMER2_OVF_INT_ENA_M  (LEDC_TIMER2_OVF_INT_ENA_V << LEDC_TIMER2_OVF_INT_ENA_S)
#define LEDC_TIMER2_OVF_INT_ENA_V  0x00000001
#define LEDC_TIMER2_OVF_INT_ENA_S  2
/* LEDC_TIMER3_OVF_INT_ENA : R/W; bitpos: [3]; default: 0;
 * The interrupt enable bit for the LEDC_TIMER3_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER3_OVF_INT_ENA    (BIT(3))
#define LEDC_TIMER3_OVF_INT_ENA_M  (LEDC_TIMER3_OVF_INT_ENA_V << LEDC_TIMER3_OVF_INT_ENA_S)
#define LEDC_TIMER3_OVF_INT_ENA_V  0x00000001
#define LEDC_TIMER3_OVF_INT_ENA_S  3
/* LEDC_DUTY_CHNG_END_CH0_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH0_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH0_INT_ENA    (BIT(4))
#define LEDC_DUTY_CHNG_END_CH0_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH0_INT_ENA_V << LEDC_DUTY_CHNG_END_CH0_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH0_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH0_INT_ENA_S  4
/* LEDC_DUTY_CHNG_END_CH1_INT_ENA : R/W; bitpos: [5]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH1_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH1_INT_ENA    (BIT(5))
#define LEDC_DUTY_CHNG_END_CH1_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH1_INT_ENA_V << LEDC_DUTY_CHNG_END_CH1_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH1_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH1_INT_ENA_S  5
/* LEDC_DUTY_CHNG_END_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH2_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH2_INT_ENA    (BIT(6))
#define LEDC_DUTY_CHNG_END_CH2_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH2_INT_ENA_V << LEDC_DUTY_CHNG_END_CH2_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH2_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH2_INT_ENA_S  6
/* LEDC_DUTY_CHNG_END_CH3_INT_ENA : R/W; bitpos: [7]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH3_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH3_INT_ENA    (BIT(7))
#define LEDC_DUTY_CHNG_END_CH3_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH3_INT_ENA_V << LEDC_DUTY_CHNG_END_CH3_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH3_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH3_INT_ENA_S  7
/* LEDC_DUTY_CHNG_END_CH4_INT_ENA : R/W; bitpos: [8]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH4_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH4_INT_ENA    (BIT(8))
#define LEDC_DUTY_CHNG_END_CH4_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH4_INT_ENA_V << LEDC_DUTY_CHNG_END_CH4_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH4_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH4_INT_ENA_S  8
/* LEDC_DUTY_CHNG_END_CH5_INT_ENA : R/W; bitpos: [9]; default: 0;
 * The interrupt enable bit for the LEDC_DUTY_CHNG_END_CH5_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH5_INT_ENA    (BIT(9))
#define LEDC_DUTY_CHNG_END_CH5_INT_ENA_M  (LEDC_DUTY_CHNG_END_CH5_INT_ENA_V << LEDC_DUTY_CHNG_END_CH5_INT_ENA_S)
#define LEDC_DUTY_CHNG_END_CH5_INT_ENA_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH5_INT_ENA_S  9
/* LEDC_OVF_CNT_CH0_INT_ENA : R/W; bitpos: [10]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH0_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH0_INT_ENA    (BIT(10))
#define LEDC_OVF_CNT_CH0_INT_ENA_M  (LEDC_OVF_CNT_CH0_INT_ENA_V << LEDC_OVF_CNT_CH0_INT_ENA_S)
#define LEDC_OVF_CNT_CH0_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH0_INT_ENA_S  10
/* LEDC_OVF_CNT_CH1_INT_ENA : R/W; bitpos: [11]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH1_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH1_INT_ENA    (BIT(11))
#define LEDC_OVF_CNT_CH1_INT_ENA_M  (LEDC_OVF_CNT_CH1_INT_ENA_V << LEDC_OVF_CNT_CH1_INT_ENA_S)
#define LEDC_OVF_CNT_CH1_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH1_INT_ENA_S  11
/* LEDC_OVF_CNT_CH2_INT_ENA : R/W; bitpos: [12]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH2_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH2_INT_ENA    (BIT(12))
#define LEDC_OVF_CNT_CH2_INT_ENA_M  (LEDC_OVF_CNT_CH2_INT_ENA_V << LEDC_OVF_CNT_CH2_INT_ENA_S)
#define LEDC_OVF_CNT_CH2_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH2_INT_ENA_S  12
/* LEDC_OVF_CNT_CH3_INT_ENA : R/W; bitpos: [13]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH3_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH3_INT_ENA    (BIT(13))
#define LEDC_OVF_CNT_CH3_INT_ENA_M  (LEDC_OVF_CNT_CH3_INT_ENA_V << LEDC_OVF_CNT_CH3_INT_ENA_S)
#define LEDC_OVF_CNT_CH3_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH3_INT_ENA_S  13
/* LEDC_OVF_CNT_CH4_INT_ENA : R/W; bitpos: [14]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH4_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH4_INT_ENA    (BIT(14))
#define LEDC_OVF_CNT_CH4_INT_ENA_M  (LEDC_OVF_CNT_CH4_INT_ENA_V << LEDC_OVF_CNT_CH4_INT_ENA_S)
#define LEDC_OVF_CNT_CH4_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH4_INT_ENA_S  14
/* LEDC_OVF_CNT_CH5_INT_ENA : R/W; bitpos: [15]; default: 0;
 * The interrupt enable bit for the LEDC_OVF_CNT_CH5_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH5_INT_ENA    (BIT(15))
#define LEDC_OVF_CNT_CH5_INT_ENA_M  (LEDC_OVF_CNT_CH5_INT_ENA_V << LEDC_OVF_CNT_CH5_INT_ENA_S)
#define LEDC_OVF_CNT_CH5_INT_ENA_V  0x00000001
#define LEDC_OVF_CNT_CH5_INT_ENA_S  15

/** LEDC_INT_CLR_REG register
 *  Interrupt clear
 *  bits
 */
#define LEDC_INT_CLR_REG (DR_REG_LEDC_BASE + 0xcc)
/* LEDC_TIMER0_OVF_INT_CLR : WT; bitpos: [0]; default: 0;
 * Set this bit to clear the LEDC_TIMER0_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER0_OVF_INT_CLR    (BIT(0))
#define LEDC_TIMER0_OVF_INT_CLR_M  (LEDC_TIMER0_OVF_INT_CLR_V << LEDC_TIMER0_OVF_INT_CLR_S)
#define LEDC_TIMER0_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER0_OVF_INT_CLR_S  0
/* LEDC_TIMER1_OVF_INT_CLR : WT; bitpos: [1]; default: 0;
 * Set this bit to clear the LEDC_TIMER1_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER1_OVF_INT_CLR    (BIT(1))
#define LEDC_TIMER1_OVF_INT_CLR_M  (LEDC_TIMER1_OVF_INT_CLR_V << LEDC_TIMER1_OVF_INT_CLR_S)
#define LEDC_TIMER1_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER1_OVF_INT_CLR_S  1
/* LEDC_TIMER2_OVF_INT_CLR : WT; bitpos: [2]; default: 0;
 * Set this bit to clear the LEDC_TIMER2_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER2_OVF_INT_CLR    (BIT(2))
#define LEDC_TIMER2_OVF_INT_CLR_M  (LEDC_TIMER2_OVF_INT_CLR_V << LEDC_TIMER2_OVF_INT_CLR_S)
#define LEDC_TIMER2_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER2_OVF_INT_CLR_S  2
/* LEDC_TIMER3_OVF_INT_CLR : WT; bitpos: [3]; default: 0;
 * Set this bit to clear the LEDC_TIMER3_OVF_INT
 * interrupt.
 */
#define LEDC_TIMER3_OVF_INT_CLR    (BIT(3))
#define LEDC_TIMER3_OVF_INT_CLR_M  (LEDC_TIMER3_OVF_INT_CLR_V << LEDC_TIMER3_OVF_INT_CLR_S)
#define LEDC_TIMER3_OVF_INT_CLR_V  0x00000001
#define LEDC_TIMER3_OVF_INT_CLR_S  3
/* LEDC_DUTY_CHNG_END_CH0_INT_CLR : WT; bitpos: [4]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH0_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR    (BIT(4))
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH0_INT_CLR_V << LEDC_DUTY_CHNG_END_CH0_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH0_INT_CLR_S  4
/* LEDC_DUTY_CHNG_END_CH1_INT_CLR : WT; bitpos: [5]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH1_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR    (BIT(5))
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH1_INT_CLR_V << LEDC_DUTY_CHNG_END_CH1_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH1_INT_CLR_S  5
/* LEDC_DUTY_CHNG_END_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH2_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR    (BIT(6))
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH2_INT_CLR_V << LEDC_DUTY_CHNG_END_CH2_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH2_INT_CLR_S  6
/* LEDC_DUTY_CHNG_END_CH3_INT_CLR : WT; bitpos: [7]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH3_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR    (BIT(7))
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH3_INT_CLR_V << LEDC_DUTY_CHNG_END_CH3_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH3_INT_CLR_S  7
/* LEDC_DUTY_CHNG_END_CH4_INT_CLR : WT; bitpos: [8]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH4_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR    (BIT(8))
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH4_INT_CLR_V << LEDC_DUTY_CHNG_END_CH4_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH4_INT_CLR_S  8
/* LEDC_DUTY_CHNG_END_CH5_INT_CLR : WT; bitpos: [9]; default: 0;
 * Set this bit to clear the LEDC_DUTY_CHNG_END_CH5_INT
 * interrupt.
 */
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR    (BIT(9))
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_M  (LEDC_DUTY_CHNG_END_CH5_INT_CLR_V << LEDC_DUTY_CHNG_END_CH5_INT_CLR_S)
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_V  0x00000001
#define LEDC_DUTY_CHNG_END_CH5_INT_CLR_S  9
/* LEDC_OVF_CNT_CH0_INT_CLR : WT; bitpos: [10]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH0_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH0_INT_CLR    (BIT(10))
#define LEDC_OVF_CNT_CH0_INT_CLR_M  (LEDC_OVF_CNT_CH0_INT_CLR_V << LEDC_OVF_CNT_CH0_INT_CLR_S)
#define LEDC_OVF_CNT_CH0_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH0_INT_CLR_S  10
/* LEDC_OVF_CNT_CH1_INT_CLR : WT; bitpos: [11]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH1_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH1_INT_CLR    (BIT(11))
#define LEDC_OVF_CNT_CH1_INT_CLR_M  (LEDC_OVF_CNT_CH1_INT_CLR_V << LEDC_OVF_CNT_CH1_INT_CLR_S)
#define LEDC_OVF_CNT_CH1_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH1_INT_CLR_S  11
/* LEDC_OVF_CNT_CH2_INT_CLR : WT; bitpos: [12]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH2_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH2_INT_CLR    (BIT(12))
#define LEDC_OVF_CNT_CH2_INT_CLR_M  (LEDC_OVF_CNT_CH2_INT_CLR_V << LEDC_OVF_CNT_CH2_INT_CLR_S)
#define LEDC_OVF_CNT_CH2_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH2_INT_CLR_S  12
/* LEDC_OVF_CNT_CH3_INT_CLR : WT; bitpos: [13]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH3_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH3_INT_CLR    (BIT(13))
#define LEDC_OVF_CNT_CH3_INT_CLR_M  (LEDC_OVF_CNT_CH3_INT_CLR_V << LEDC_OVF_CNT_CH3_INT_CLR_S)
#define LEDC_OVF_CNT_CH3_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH3_INT_CLR_S  13
/* LEDC_OVF_CNT_CH4_INT_CLR : WT; bitpos: [14]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH4_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH4_INT_CLR    (BIT(14))
#define LEDC_OVF_CNT_CH4_INT_CLR_M  (LEDC_OVF_CNT_CH4_INT_CLR_V << LEDC_OVF_CNT_CH4_INT_CLR_S)
#define LEDC_OVF_CNT_CH4_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH4_INT_CLR_S  14
/* LEDC_OVF_CNT_CH5_INT_CLR : WT; bitpos: [15]; default: 0;
 * Set this bit to clear the LEDC_OVF_CNT_CH5_INT
 * interrupt.
 */
#define LEDC_OVF_CNT_CH5_INT_CLR    (BIT(15))
#define LEDC_OVF_CNT_CH5_INT_CLR_M  (LEDC_OVF_CNT_CH5_INT_CLR_V << LEDC_OVF_CNT_CH5_INT_CLR_S)
#define LEDC_OVF_CNT_CH5_INT_CLR_V  0x00000001
#define LEDC_OVF_CNT_CH5_INT_CLR_S  15


/** Version Register */

/** LEDC_DATE_REG register
 *  Version control
 *  register
 */
#define LEDC_DATE_REG (DR_REG_LEDC_BASE + 0xfc)
/* LEDC_LEDC_DATE : R/W; bitpos: [32:0]; default: 419829504;
 * This is the version control
 * register.
 */
#define LEDC_LEDC_DATE    0xFFFFFFFF
#define LEDC_LEDC_DATE_M  (LEDC_LEDC_DATE_V << LEDC_LEDC_DATE_S)
#define LEDC_LEDC_DATE_V  0xFFFFFFFF
#define LEDC_LEDC_DATE_S  0


#ifdef __cplusplus
}
#endif
